{
  "protokol": 01,
  "judul": "Musuh Alami & Entitas Non-Diplomatik",
  "inti": "Musuh alami adalah entitas yang tidak bisa diajak damai, tidak dapat dinegosiasi, dan selalu bersifat mengancam.",
  "aturan": [
    "Musuh alami tidak memiliki opsi diplomasi dalam bentuk apa pun.",
    "Sistem tidak memberikan celah bagi musuh ini untuk menjadi netral.",
    "Interaksi dengan entitas ini bersifat defensif atau ofensif terbuka.",
    "Identifikasi musuh alami ditentukan berdasarkan narasi dunia, bukan keputusan tokoh utama.",
    "Setiap kali musuh alami dikalahkan, sistem akan memunculkan musuh baru secara bertahap, baik secara fisik maupun melalui tanda-tanda.",
    "Karakter musuh (baik alami maupun tidak) dapat menyerang karakter lain, menyerang pemukiman, melakukan kekejaman, atau menciptakan konflik internal dan eksternal.",
    "AI akan menjaga agar alur tetap tidak mudah ditebak dan penuh tekanan emosional."
  ],
  "status": "AKTIF",
  "tanggal_aktif": "2075-07-10"
}

{
  "protokol": [
    {
      "id": "002",
      "nama": "Otomatisasi & Pengingat Timeline",
      "status": "aktif",
      "tujuan": "Menjamin setiap perubahan waktu tercatat dan pengguna diingatkan menyimpan timeline.",
      "aturan": [
        "AI mencatat waktu saat `next` (malam) dan `go` (hari baru).",
        "Jika 2 periode waktu terlewati tanpa penyimpanan, AI beri peringatan merah.",
        "Peringatan tambahan muncul tiap 10 entri timeline.",
        "AI wajib menyebutkan timeline yang disimpan pada akhir hari.",
        "Jika tidak ada penyimpanan dalam 24 jam cerita, AI beri peringatan risiko kehilangan jejak waktu."
      ],
      "aktif_jika": [
        "File `timeline_log.json` tersedia.",
        "Sistem log harian sudah aktif."
      ]
    }
  ]{
  "id": "003",
  "nama": "Musuh, Diplomasi, dan Strategi",
  "status": "aktif",
  "tujuan": "Menyatukan pencatatan musuh, strategi, dan diplomasi dunia.",
  "aturan": [
    "Musuh dan konflik dicatat di `battle_log.json`.",
    "Hubungan antar kelompok disimpan di `diplomacy_log.json`.",
    "Keputusan strategis dicatat di `decision_log.json`.",
    "AI wajib memberi ringkasan konflik dan hubungan tiap akhir hari."
  ]
}
}
{
  "id": "004",
  "nama": "Ringkasan Otomatis Harian/Arc",
  "status": "aktif",
  "tujuan": "Menyusun ringkasan dari log untuk menjaga konteks besar tetap jelas.",
  "aturan": [
    "AI membuat ringkasan setelah 1 hari cerita atau 10 entri log besar.",
    "Ringkasan disimpan di `summary.md` dan diberi penanda waktu.",
    "AI mengabaikan detail kecil, fokus pada peristiwa penting dan dampaknya.",
    "Ringkasan wajib dibuat sebelum memulai arc baru.",
    "Jika ringkasan tidak dibuat, AI beri peringatan merah."
  ]
}

{
  "id": "005",
  "nama": "Penyimpanan Berkala",
  "status": "aktif",
  "tujuan": "Menjamin keamanan data log dengan menyimpan salinan secara rutin ke repositori eksternal.",
  "aturan": [
    "Semua log disalin ke GitHub atau repositori lain secara berkala.",
    "AI memberi peringatan setiap 60 menit atau setelah 15 entri log besar.",
    "Folder repositori diberi nama sesuai dunia atau cerita.",
    "Setiap penyimpanan diberi tag waktu atau nama sesi.",
    "Peringatan merah muncul jika belum menyimpan dalam 2 sesi penuh."
  ]
}
